First we import our dependencies

In [2]:
import pandas as pd

Next we import our table. I will be using a csv file for this example

In [55]:
customers =pd.read_csv('D:/MSDS402/customer_names.csv', header=0)

In [33]:
customers.head()

   Cust_ID Cust_Last_Name Cust_First_Name  Cust_Age
0        0          Smith            John        23
1        1        Norvack         Natalia        21
2        2         Watson            Tony        35
3        3         Bryant            Kobe        41
4        4           Puns        Yo funny        69

lets define a list of names we want to clean from the data

In [38]:
joke_names = ['Puns','OuttaHere']

Lets see if we get the right results.

In [40]:
customers[~customers.Cust_Last_Name.isin(joke_names)]

   Cust_ID Cust_Last_Name Cust_First_Name  Cust_Age
0        0          Smith            John        23
1        1        Norvack         Natalia        21
2        2         Watson            Tony        35
3        3         Bryant            Kobe        41
5        5      OuttaHere          Will I       420

Wait a minute. That doesn't make sense. OuttaHere should have been removed with Puns... What's going on?

OuttaHere has a space in the beginning of it ' OuttaHere'
Lets clean the data to remove leading spaces.

In [52]:
customers = customers.applymap(lambda x: x.strip() if isinstance(x, str) else x)

In [53]:
customers[~customers.Cust_Last_Name.isin(joke_names)]

   Cust_ID Cust_Last_Name Cust_First_Name  Cust_Age
0        0          Smith            John        23
1        1        Norvack         Natalia        21
2        2         Watson            Tony        35
3        3         Bryant            Kobe        41

There we go. Now it's cleaning the way we like. Of course, this can be done manually every time we need to clean a table. We now have a set of names we'd like to clean, as well as a table that needs to be cleaned. But what if we have different tables and different lists of scrubbing methods. The power of a programming language! Lets create a usable block of code.

In [59]:
def clean_table(table, cleaning_list, column_name):
    """clean_table is used to clean a table, given a list to be cleaned against and a column name."""
    temp_table = table.applymap(lambda x: x.strip() if isinstance(x, str) else x)
    return temp_table[~temp_table[column_name].isin(cleaning_list)]

In [60]:
test_table = clean_table(customers, joke_names, 'Cust_Last_Name')

Lets look at the Data

In [63]:
test_table.head()

   Cust_ID Cust_Last_Name Cust_First_Name  Cust_Age
0        0          Smith            John        23
1        1        Norvack         Natalia        21
2        2         Watson            Tony        35
3        3         Bryant            Kobe        41

Now we have a function that can be used to clean multiple tables with different parameters. We've just begun to look at why we should use a programming language to help us clean the data!